<!-- dflook/terraform-github-actions {"workspace":"fix-github-output","backend":"c33778e91dea6cf6e9ed20e19d56f55d4873ed76826679e8a1f54d7e38a110be","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","plan_job_ref":"Job Test plan target and replace #260 at https://github.com/dflook/terraform-github-actions/actions/runs/3263967757","plan_hash":"706c5081384622df133ddb9299e758208a9969ff1c18deaaa080660a9161c3f2","plan_text_format":"text"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __fix-github-output__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "Ez5ekUJ1m1" -> (known after apply)
  ~ foreach = "tIwgQCPJQe" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #260](https://github.com/dflook/terraform-github-actions/actions/runs/3263967757)